{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"sequential_4_input": {"name": "sequential_4_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}}, "outputs": {"outputs": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5/rescaling_5/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/rescaling_5/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/flatten_3/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30976"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/outputs/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/outputs/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "sequential_4_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/rescaling_5/mul", "op": "Mul", "input": ["sequential_4_input", "StatefulPartitionedCall/sequential_5/rescaling_5/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/rescaling_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5/rescaling_5/mul", "StatefulPartitionedCall/sequential_5/rescaling_5/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/rescaling_5/add", "StatefulPartitionedCall/sequential_5/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_9/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_9/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_10/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_9/MaxPool", "StatefulPartitionedCall/sequential_5/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_10/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_10/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_11/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_10/MaxPool", "StatefulPartitionedCall/sequential_5/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_5/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/max_pooling2d_11/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/conv2d_11/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/flatten_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_5/max_pooling2d_11/MaxPool", "StatefulPartitionedCall/sequential_5/flatten_3/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_5/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/flatten_3/Reshape", "StatefulPartitionedCall/sequential_5/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_5/outputs/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/dense_5/Relu", "StatefulPartitionedCall/sequential_5/outputs/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/outputs/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5/outputs/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5/rescaling_5/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/rescaling_5/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_9/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_9/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_10/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_11/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/conv2d_11/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/flatten_3/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_5/MatMul/ReadVariableOp", "shape": [30976, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/dense_5/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/outputs/MatMul/ReadVariableOp", "shape": [128, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/outputs/BiasAdd/ReadVariableOp", "shape": [5], "dtype": "float32"}]}]}